# Scale Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform2D..::..Scale Property
Transform2D Class See Also
---
The real number that represents the scale of the conformal transformation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public double Scale { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Scale As Double
	Get
```

Visual C++
---
```text
public:
property double Scale {
	double get ();
}
```

# Remarks
When the transformation is conformal and can be decomposed as the product of a rigid-body motion, uniform scale and reflection, this property returns the scale value of the uniform scale transformation.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This transformation is not conformal and the scale is undefined. |

# See Also
Transform2D Class
Autodesk.Revit.DB Namespace